{
  "head": {
    "title": "Gonagutor - Fullstack Developer",
    "description": "Hi! I'm Gonzalo, a fullstack developer. I love programming and doing cool things. I do front-end for websites, WebApps, apps and back-end",
    "shortDescription": "Hi! I'm Gonzalo a fullstack developer. And I love cool projects",
    "shorterDescription": "Gonzalo - Fullstack developer",
    "url": "https://www.gonagutor.com",
    "previewImage": "/images/projects/website.jpg"
  },
  "welcome": {
    "hi": "Hi!",
    "presentation": "I'm Gonzalo",
    "whatIDo": "I'm a developer",
    "whatILike": "I love programming and doing cool things",
    "thatsMe": "That's me!",
    "theresMore": "There's more!"
  },
  "aboutMe": {
    "aboutMe": "About Me",
    "fstParagraph": "I'm a developer with a passion for anything related to programming.",
    "sndParagraph": "I love big projects with lots of moving parts. I prefer things that include Front-End since making UI that looks good is something I like, but I also love doing Back-End. I also love designing things that look cool.",
    "thrParagraphBeforeLink": "While I make most of my projects to satisfy my own curiosity, or make things for me and my friends to enjoy, I am also a student at",
    "thrParagraphAfterLink": "where I am learning things like C, server stuff, and lots more things.",
    "fthParagraph": "I live in Spain, Madrid to be exact. Apart from programming I love games, Sci-Fi (Movies and books) and playing Dungeons And Dragons."
  },
  "techstack": {
    "myTechstack": "My Techstack",
    "approach": "My approach for a project usually is to research which technology is best for the situation.",
    "approachComment": "I mostly do not care whether I have used the framework, languages, or server architecture before.",
    "benefits": "Because of this I have used a lot of current technologies, and because I always do big complete projects I am also very proficient with them.",
    "languagesIUse": "Languages I use:",
    "languagesList": "JavaScript, TypeScript, Dart, CSS, HTML, PHP, SQL, C, C#, Java & Python",
    "frameworksIKnow": "Frameworks I know:",
    "frameworksList": "Vue, React, Angular, Express, Symphony & Flutter",
    "otherUsefulThingsIKnow": "Other useful things I know:",
    "otherUsefulThingsList": "Git, MongoDB, PostgreSQL, GraphQL, Apache, Nginx, Node.js, VSCode, Figma, SASS, REST, Docker, ES6 & ES5"
  },
  "projects": [
    {
      "title": "DnDmin",
      "description": "I made this app using Flutter, Express, PHP, SQL and MongoDB.\n This app was created because I was playing dnd and all the options that players had to create their characters using an app were not great, so I decided to make one myself. \nFurthermore I wanted to make a system so players could move their characters in a virtual map inside a custom unity game (Socket.JS as server), but that is still in development.\nThis app took a really long time to make (it is still in development) because this was a complete full stack project, in which I fully implemented authentication with roles, an API, different characters for the same user and a fully implemented DnD database containing everything from the book (this database is not public for legal reasons)",
      "image": "/images/projects/dndmin.png",
      "links": [
        {
          "icon": "",
          "text": "",
          "link": ""
        }
      ]
    },
    {
      "title": "TikVault",
      "description": "I made this app using React Native.\n This app was created because I was annoyed that TikTok doesn't let you properly classify the videos you download or like, and i ended up having thousands of recipe videos scattered across my gallery which made it impossible to look for an specific recipe.\n It let's you organize videos in specific categories so you can easily find them later, and it also downloads them and let's you rename them while keeping the original username, like count and description.\nIt's a really complicated app to mantain since I needed to reverse engenieer TikTok's download system, which changes a lot. This feature was also recently added to TikTok itself\n I published this app in Google Play and you can download it below",
      "image": "/images/projects/tikvault.png",
      "links": [
        {
          "icon": "",
          "text": "",
          "link": ""
        }
      ]
    },
    {
      "title": "Telsokit IO",
      "description": "I made this app using Flutter.\n This app was created for Telsokit S.L.\n It works together with a physical device to play and schedule sound alarms and notices by comunicating over TCP.",
      "image": "/images/projects/telsokitapp.png",
      "links": [
        {
          "icon": "",
          "text": "",
          "link": ""
        }
      ]
    },
    {
      "title": "Sparkel",
      "description": "I made this web app, along with a friend, using React, PostgreSQL, Amazon S3 and Express.\n This web app was created to teach a friend programming during summer.\n It is a Instagram-like social media meant for our friend group to use. It has instant messaging, text and image posts and stories. It is still in development ",
      "image": "/images/projects/sparkel.png",
      "links": [
        {
          "icon": "",
          "text": "",
          "link": ""
        }
      ]
    },
    {
      "title": "This website!",
      "description": "I made this website using React and Next.js (hosted by Vercel).\nThis site is available in Spanish and English\n This serves as my portfolio aswell as something cool to show when someone asks me what I do.",
      "image": "/images/projects/website.jpg",
      "links": [
        {
          "icon": "",
          "text": "",
          "link": ""
        }
      ]
    }
  ],
  "contactMe": {
    "contactMe": "Contact me!",
    "contactMeDescription": "If you'd wish to contact me you use this form, which will send me an email, or you can also reach me by sending me an email your self at",
    "preferedContactMethod": "You can also reach me on other platforms, like LinkedIn, but the most efficient way for me is email",
    "checkoutMyGithubPreLink": "You should also check out my",
    "checkoutMyGithubPostLink": "by clicking on the button on the top right (bottom of the nav menu if you are on a mobile device) or by clicking on the bold github text",
    "form": {
      "placeholders": {
        "name": "Your name",
        "email": "Your email",
        "text": "Write me a lovely e-letter!"
      },
      "required": "This field is required",
      "noLongerThan": "and must not be longer than 5000 characters",
      "pleaseCompleteTheCaptcha": "Please complete the captcha",
      "send": "Send the message!"
    }
  }
}
